const blog = {
    state: {
        blog: [
            {
                title: '中国共产党',
                content: `中国共产党（英文名：the Communist Party of China，简写CPC），创建于1921年7月23日 [1]  ，1921
            年中国共产党成立后，确立了新民主主义革命的正确道路，让灾难深重的中国人民看到了新的希望、有了
            新的依靠。我们党探索出农村包围城市、武装夺取政权的正确革命道路，“唤起工农千百万”“夺过鞭子
            揍敌人”，经过土地革命战争、抗日战争、解放战争，推翻了压在中国人民头上的帝国主义、封建主义、
            官僚资本主义“三座大山”，建立了人民当家作主的中华人民共和国，彻底结束了近代以来中国内忧外患
            、积贫积弱的悲惨境地，开启了中华民族发展进步的新纪元。 [15] 
            中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的
            领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本
            利益。党的最高理想和最终目标是实现共产主义。 [2] 
            中国共产党以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观、习近平
            新时代中国特色社会主义思想作为自己的行动指南。中国共产党领导是中国特色社会主义最本质的特征。
            [3-4] `
            },
            {
                title: '失恋深夜网文',
                content: `如果有一天，我决定删了你，并不代表你对我不再重要，而是我怕自己，越陷越深。
            原来真的有那么一个人，我无数次地说要放弃，但是终究还是舍不得。
            时间并不会真的帮我们解决什么问题，她只是把原来怎么也想不通的问题，变得不再重要了，
            谁都没有比谁生活的容易，只是有的人呼天抢地，痛不欲生，而有的人，却默默地咬牙，
            逼自己学会坚持。有时候删掉一个人不是因为想要忘记，而是因为很难忘记，因为手机里有一个你，
            所以总是放不下心，尝尝忍不住拿起手机找出你的名字，打很长的一段话，却没有发出去的勇气。
            看到你朋友圈的更新，会莫名的难受，为什么在你身边的人不是我。总想知道你的一切，却只能小心的窥探。
            有时还会拨通你的电话迅速按掉，如果你回过来了，明明心里小鹿乱撞，还要假装镇定的说，“不好意思
            ，刚刚不小心拨错了。”其实无数次的想要放弃，却总是舍不得。时常讨厌这样卑微的爱着你的自己，
            时常生气这样放不下你的自己，除了删除了你，我不知道还有什么办法可以不想你。我想，也许只有删了你，
            再也无法联系你，才是忘记你最好的办法。我自欺欺人的以为删掉你就能断掉与你的一切联系，可我知道的，
            那些与你有关回忆，我怎么都不可能忘记，但我也知道，我不能再打扰你了。所以只有把你删了我才不用担心某一天，
            我会忍不住，去打扰你。说我想你想到快疯掉的夜，还是在四下无人我一个人喝醉的街。不会了，以后都不会了。
            我还是会很想你还是喜欢你，但你不会知道了。所以如果有一天，你发现我删了你，你要知道这不是因为你对我不再重要，
            而是我怕自己会越陷越深，希望你能为我高兴，因为我终于认清了你的世界根本不需要我，我们今后的人生也再不会有交集。
            我终于放下了内心的执念，留着泪，把你送出了我的世界，也许随着时光的流逝，我会把原来怎么也想不通的问题想通了，
            会把原来怎么也舍不得忘记的你忘记了。我可能还是会想你，那张被我删掉的数字，可能早就刻在了我的脑海里。我可能还是喜欢你，
            还是会想起我们的过去，但这些，你都不会知道了。希望有那么一天，我无意中翻到你的名字时，心里不再泛起涟漪，偶尔听到别人提起你，我也能微笑带过……`
            },
            {
                title: 'God',
                content: `Maybe God wants us to meet a few wrong people before 
            meeting the right one so that when we finally meet the person we will know how to be grateful`
            },
            {
                title: '晚安语录',
                content: `早点休息 说不定今晚有个甜甜的梦
            “你坚持的东西总有一天会反过来拥抱你”    
            希望做梦能够笑醒 每天都可爱
            你好 我是快乐警察 请你配合我的工作 现在我要抓走你所有的不开心
            “生活没那么顺心 可别忘了你还要成为梦想中的人”    
            祝你好梦 不止今晚    
            “不要因为别人的一句话而夺走你今天的快乐”    
            “雨后草木间湿漉漉的味道 是治愈不开心的良药 如果还有别的什么的话 那就去舒舒服服的热水澡配上原味香皂”
                “不快乐的开关在哪 我要把它拆掉”    
            “生活就要可可爱爱₍•ʚ•₎”    
            种自己的花 爱自己的宇宙”    
            “抬头看 月亮给太阳写信 铺开天空墨黑的信笺 用银亮亮的月光 写下轻柔的问候 晚安”    “活的舒服一点 不要老做让自己不开心的事”    
            “在容易快乐的年纪 不快乐有点可惜”    
            “前路未必是光明坦荡 但也一定充满无限可能。”    
            “先笑一下 说不定你期待的事等等就来了 ”    
            亲一口月亮 然后就睡觉
            “我睡不着数小羊的时候也希望有一只小羊在数我"    
            "不知道方向在哪里的时候 就停下脚步看一看"    
            “希望你们身边有这样的人 他们可能懂得你的喜好 记得你随口说出的话 认真听你的每次分享 总能接住你下坠的自尊心 这种被重视的感觉太奇妙了 什么人间不值得 就冲着他们对你这么好 任何都值得。”    
            不管是感情还是生活 见好就收 不行就撤
            “今晚帮你把月亮摘掉 然后用暮色裁剪一席小被子 不用担心睡不好觉 晚安(¦3[▓▓] 
            “梦里记得想我 早上记得早安” 
            到点了把烦恼暂停一下 挂上月亮睡觉    
            “小朋友负责吃好喝好不烦恼”    
            “给你一点甜甜让你今夜很好眠
            什么时候来跟我说晚安ヽ(･ω･｡)ﾉ    
            “我已经准备闭好一只眼睛了 等到你的晚安就闭上另一只”    
            “星星被我撒了魔法 现在睡觉的即可获得美梦一份 晚安”   
            “只在意侵袭过来的快乐 不再去想抓住什么 尽力开心(*^▽^*)”    
            I'm here for you.
            Спокойной ночи!    
            bonne nuit    
            buenas noches
            冠状动脉供血不足引发心肌急剧缺氧
            dorme bem
            明月装饰了你的窗子，你装饰了别人的梦 
            别睡太晚梦会变短
            `
            }
        ]
    },
    mutations: {
        changeBlog(state, changeBlog) {
            state.blog[changeBlog.index] = { title: changeBlog.title, content: changeBlog.content }
            console.log(state.blog[changeBlog.index]);
            console.log(this);
        },
        createBlog(state, newBlog) {
            state.blog.push(newBlog)
        },
        removeBlog(state, index) {
            state.blog.splice(index, 1)
        },
        setBlog(state, setBlog) {
            state.blog = setBlog
            console.log(setBlog);
        },
        updateBlog(state,blog){
            state.blog = blog
        }
    },
    actions: {
    },
    modules: {
    }
}
export default blog